Repository: gooog1111/luci-i18n-openwrt-passwall2-ru
Catalog: passwall2.*.po
Languages: ru

source: Enable Geo Data Parsing
ru: Включить анализ Geo-данных

source: Analyzes and preloads GeoIP/Geosite data to enhance the shunt performance of Sing-box/Xray.
ru: Анализирует и предзагружает данные GeoIP/Geosite для улучшения разделения трафика в Sing-box/Xray.

source: Note: Increases resource usage.
ru: Примечание: увеличивает использование ресурсов.

source: Shunt Rule
ru: Правило разделения трафика

source: Please note attention to the priority, the higher the order, the higher the priority.
ru: Обратите внимание на приоритет: чем выше элемент в списке, тем выше его приоритет.

source: Update...
ru: Обновление...

source: It is the latest version
ru: Это последняя версия

source: Update successful
ru: Обновление успешно

source: Click to update
ru: Нажмите для обновления

source: Updating...
ru: Обновляется...

source: Retry
ru: Повторить

source: Unexpected error
ru: Неожиданная ошибка

source: Updating, are you sure to close?
ru: Идёт обновление, точно закрыть?

source: Downloading...
ru: Скачивание...

source: Unpacking...
ru: Распаковка...

source: Moving...
ru: Перемещение...

source: App Update
ru: Обновление компонента

source: Please confirm that your firmware supports FPU.
ru: Пожалуйста, убедитесь, что ваша прошивка поддерживает FPU.

source: if you want to run from memory, change the path, /tmp beginning then save the application and update it manually.
ru: Если вы хотите запускать из памяти, измените путь, начав с /tmp, затем сохраните настройки и обновите приложение вручную.

source: Make sure there is enough space to install %s
ru: Убедитесь, что достаточно места для установки %s

source: App Path
ru: Путь к программе

source: %s App Path
ru: Путь к %s

source: %s Client App Path
ru: Путь к клиенту %s

source: Node Subscribe
ru: Подписка на узлы

source: Subscribe Remark
ru: Примечание к подписке (провайдер)

source: Subscribe Info
ru: Информация о подписке

source: Subscribe URL
ru: URL подписки

source: Subscribe URL Access Method
ru: Метод доступа к URL подписки

source: When adding a new subscription, please save and apply before manually subscribing. If you only change the subscribe URL, you can subscribe manually, and the system will save it automatically.
ru: При добавлении новой подписки сначала сохраните и примените настройки, затем подпишитесь вручную. Если меняется только URL подписки, можно подписаться вручную сразу, система сохранит автоматически.

source: Please save and apply before manually subscribing.
ru: Пожалуйста, сначала сохраните и примените настройки, затем подпишитесь вручную.

source: Subscribe URL cannot be empty.
ru: URL подписки не может быть пустым.

source: Subscribe via proxy
ru: Подписываться через прокси

source: Enable auto update subscribe
ru: Включить автоматическое обновление подписок

source: Manual subscription
ru: Ручная подписка

source: Delete All Subscribe Node
ru: Удалить все узлы из подписок

source: Delete the subscribed node
ru: Удалить подписанные узлы

source: Are you sure you want to delete all subscribed nodes?
ru: Вы уверены, что хотите удалить все подписанные узлы?

source: Manual subscription All
ru: Подписаться на всё вручную

source: This remark already exists, please change a new remark.
ru: Это примечание уже существует, пожалуйста, используйте другое.

source: Remark cannot be empty.
ru: Примечание не может быть пустым.

source: URL cannot be empty.
ru: URL не может быть пустым.

source: Filter keyword Mode
ru: Режим фильтрации по ключевым словам

source: Discard List
ru: Чёрный список

source: Keep List
ru: Белый список

source: Discard List,But Keep List First
ru: Чёрный список, но Белый список в приоритете

source: Keep List,But Discard List First
ru: Белый список, но Чёрный список в приоритете

source: Use global config
ru: Использовать глобальную конфигурацию

source: Add
ru: Добавить

source: ACLs
ru: Списки контроля доступа (ACL)

source: ACLs is a tools which used to designate specific IP proxy mode.
ru: ACL — это инструмент для назначения определённого режима прокси для конкретных IP.

source: Example:
ru: Пример:

source: IP range
ru: Диапазон IP

source: Source Interface
ru: Исходный интерфейс

source: Use Interface With ACLs
ru: Использовать контроль по интерфейсу

source: Remarks
ru: Примечание

source: Direct List
ru: Список прямого доступа

source: Proxy List
ru: Список прокси

source: Block List
ru: Список блокировки

source: Lan IP List
ru: Список LAN IP

source: Route Hosts
ru: Hosts-файл роутера

source: Join the direct hosts list of domain names will not proxy.
ru: Домены, добавленные в этот список, не будут идти через прокси. Действует для всех режимов. Наивысший приоритет.

source: These had been joined ip addresses will not proxy. Please input the ip address or ip address segment,every line can input only one ip address. For example: 192.168.0.0/24 or 223.5.5.5.
ru: IP-адреса/подсети, добавленные в этот список, не будут идти через прокси. Действует для всех режимов. Наивысший приоритет. Вводите IP или подсеть, например: 192.168.0.0/24 или 223.5.5.5, по одному на строку.

source: These had been joined websites will use proxy. Please input the domain names of websites, every line can input only one website domain. For example: google.com.
ru: Домены, добавленные в этот список, будут идти через прокси. Вводите доменные имена, например: google.com, по одному на строку.

source: These had been joined ip addresses will use proxy. Please input the ip address or ip address segment, every line can input only one ip address. For example: 35.24.0.0/24 or 8.8.4.4.
ru: IP-адреса/подсети, добавленные в этот список, будут идти через прокси. Вводите IP или подсеть, например: 35.24.0.0/24 или 8.8.4.4, по одному на строку.

source: These had been joined websites will be block. Please input the domain names of websites, every line can input only one website domain. For example: twitter.com.
ru: Домены, добавленные в этот список, будут блокироваться. Вводите доменные имена, например: twitter.com, по одному на строку.

source: The list is the IPv4 LAN IP list, which represents the direct connection IP of the LAN. If you need the LAN IP in the proxy list, please clear it from the list. Do not modify this list by default.
ru: Это список IPv4-адресов локальной сети, которые считаются прямыми. Если вам нужно, чтобы IP из LAN шли через прокси, удалите их из этого списка и добавьте в список прокси. По умолчанию не изменяйте этот список.

source: The list is the IPv6 LAN IP list, which represents the direct connection IP of the LAN. If you need the LAN IP in the proxy list, please clear it from the list. Do not modify this list by default.
ru: Это список IPv6-адресов локальной сети, которые считаются прямыми. Если вам нужно, чтобы IP из LAN шли через прокси, удалите их из этого списка и добавьте в список прокси. По умолчанию не изменяйте этот список.

source: Configure routing etc/hosts file, if you don't know what you are doing, please don't change the content.
ru: Настройка файла /etc/hosts роутера. Если вы не знаете, что делаете, не меняйте содержимое.

source: These had been joined ip addresses will be block. Please input the ip address or ip address segment, every line can input only one ip address.
ru: IP-адреса/подсети, добавленные в этот список, будут блокироваться. Вводите IP или подсеть, по одному на строку.

source: Inbound Tag
ru: Тег входящего подключения

source: Transparent proxy
ru: Прозрачный прокси

source: Not valid domain name, please re-enter!
ru: Недопустимое доменное имя, введите заново!

source: Not valid IP format, please re-enter!
ru: Неверный формат IP, введите заново!

source: Not valid IPv4 format, please re-enter!
ru: Неверный формат IPv4, введите заново!

source: Not valid IPv6 format, please re-enter!
ru: Неверный формат IPv6, введите заново!

source: Not true format, please re-enter!
ru: Неверный формат, введите заново!

source: Plaintext: If this string matches any part of the targeting domain, this rule takes effet. Example: rule 'sina.com' matches targeting domain 'sina.com', 'sina.com.cn' and 'www.sina.com', but not 'sina.cn'.
ru: Простой текст: правило срабатывает, если строка совпадает с любой частью целевого домена. Например, правило 'sina.com' соответствует доменам 'sina.com', 'sina.com.cn', 'www.sina.com', но не 'sina.cn'.

source: Regular expression: Begining with 'regexp:', the rest is a regular expression. When the regexp matches targeting domain, this rule takes effect. Example: rule 'regexp:\.goo.*\.com$' matches 'www.google.com' and 'fonts.googleapis.com', but not 'google.com'.
ru: Регулярное выражение: начинается с 'regexp:', далее следует regex. Правило срабатывает при совпадении regex с целевым доменом. Например, 'regexp:\.goo.*\.com$' соответствует 'www.google.com', 'fonts.googleapis.com', но не 'google.com'.

source: Subdomain (recommended): Begining with 'domain:' and the rest is a domain. When the targeting domain is exactly the value, or is a subdomain of the value, this rule takes effect. Example: rule 'domain:v2ray.com' matches 'www.v2ray.com', 'v2ray.com', but not 'xv2ray.com'.
ru: Поддомен (рекомендуется): начинается с 'domain:', далее следует домен. Правило срабатывает, если целевой домен точно совпадает со значением или является его поддоменом. Например, 'domain:v2ray.com' соответствует 'www.v2ray.com', 'v2ray.com', но не 'xv2ray.com'.

source: Full domain: Begining with 'full:' and the rest is a domain. When the targeting domain is exactly the value, the rule takes effect. Example: rule 'domain:v2ray.com' matches 'v2ray.com', but not 'www.v2ray.com'.
ru: Полное совпадение: начинается с 'full:', далее следует домен. Правило срабатывает только при точном совпадении целевого домена со значением. Например, 'full:v2ray.com' соответствует 'v2ray.com', но не 'www.v2ray.com'.

source: Sing-Box rule-set: Begining with 'rule-set:remote:' or 'rule-set:local:'
ru: Набор правил Sing-Box: начинается с 'rule-set:remote:' или 'rule-set:local:'

source: Such as:
ru: Например:

source: Pre-defined domain list: Begining with 'geosite:' and the rest is a name, such as geosite:google or geosite:cn.
ru: Предопределённый список доменов: начинается с 'geosite:', далее следует имя, например, geosite:google или geosite:cn.

source: Annotation: Begining with #
ru: Комментарий: начинается с #

source: Invert match result.
ru: Инвертировать результат совпадения.

source: Only support Sing-Box.
ru: Только для Sing-Box.

source: IP: such as '127.0.0.1'.
ru: IP: например, '127.0.0.1'.

source: CIDR: such as '127.0.0.0/8'.
ru: CIDR: например, '10.0.0.0/8'.

source: GeoIP: such as 'geoip:cn'. It begins with geoip: (lower case) and followed by two letter of country code.
ru: GeoIP: например, 'geoip:cn'. Должно начинаться с 'geoip:' (нижний регистр), за которым следует двубуквенный код страны.

source: Clear logs
ru: Очистить логи

source: Password
ru: Пароль

source: IV Check
ru: Проверка IV

source: UDP over TCP
ru: UDP поверх TCP

source: Connection Timeout
ru: Таймаут соединения

source: Local Port
ru: Локальный порт

source: Fast Open
ru: Быстрое открытие

source: plugin
ru: плагин

source: Supports custom SIP003 plugins, Make sure the plugin is installed.
ru: Поддержка пользовательских плагинов SIP003. Убедитесь, что плагин установлен.

source: opts
ru: опции плагина

source: Protocol
ru: Протокол

source: Protocol_param
ru: Параметр протокола

source: Obfs
ru: Обфускация

source: Obfs_param
ru: Параметр обфускации

source: Plugin Name
ru: Имя плагина

source: Plugin Arguments
ru: Аргументы плагина

source: Naiveproxy Protocol
ru: Протокол Naiveproxy

source: User Level
ru: Уровень пользователя (level)

source: Transport
ru: Способ передачи

source: Public Key
ru: Публичный ключ

source: Private Key
ru: Приватный ключ

source: Pre shared key
ru: Дополнительный симметричный ключ

source: Local Address
ru: Локальный адрес

source: System interface
ru: Системный интерфейс

source: System interface name
ru: Имя системного интерфейса

source: Decimal numbers separated by "," or Base64-encoded strings.
ru: Десятичные числа, разделённые запятыми, или строки в кодировке Base64.

source: Camouflage Domain
ru: Маскировочный домен

source: Camouflage Type
ru: Тип маскировки

source: Transport Layer Encryption
ru: Шифрование транспортного уровня

source: Whether or not transport layer encryption is enabled, "none" for unencrypted, "tls" for using TLS, "xtls" for using XTLS.
ru: Включено ли шифрование транспортного уровня: "none" — без шифрования, "tls" — использовать TLS, "xtls" — использовать XTLS.

source: Original Trojan only supported 'tls', please choose 'tls'.
ru: Оригинальный Trojan поддерживает только 'tls', пожалуйста, выберите 'tls'.

source: Transfer mode
ru: Режим передачи

source: Do not send server name in ClientHello.
ru: Не отправлять имя сервера в ClientHello.

source: Domain
ru: Домен

source: allowInsecure
ru: Разрешить небезопасные соединения

source: Whether unsafe connections are allowed. When checked, Certificate validation will be skipped.
ru: Разрешать ли небезопасные соединения. Если выбрано, проверка сертификата будет пропущена.

source: %s Node Use Type
ru: Тип использования узла %s

source: Set the TUIC proxy server ip address
ru: Укажите IP-адрес сервера TUIC

source: TUIC User Password For Connect Remote Server
ru: Пароль пользователя для подключения к удалённому серверу TUIC

source: TUIC UserName For Local Socks
ru: Имя пользователя для локального Socks-сервера

source: TUIC Password For Local Socks
ru: Пароль для локального Socks-сервера

source: UDP relay mode
ru: Режим ретрансляции UDP

source: Congestion control algorithm
ru: Алгоритм управления перегрузкой

source: Heartbeat interval(second)
ru: Интервал отправки heartbeat (секунды)

source: Timeout for establishing a connection to server(second)
ru: Таймаут установления соединения с сервером (секунды)

source: Garbage collection interval(second)
ru: Интервал очистки фрагментов UDP-пакетов (секунды)

source: Garbage collection lifetime(second)
ru: Время хранения фрагментов UDP-пакетов на сервере (секунды)

source: Disable SNI
ru: Отключить SNI

source: Enable 0-RTT QUIC handshake
ru: Включить квитирование QUIC 0-RTT на клиенте

source: TUIC send window
ru: Окно отправки (макс. байт без подтверждения, по умолч. 8Мб*2)

source: TUIC receive window
ru: Окно приёма (макс. байт без подтверждения, по умолч. 8Мб)

source: TUIC Maximum packet size the socks5 server can receive from external, in bytes
ru: Максимальный размер пакета, который socks5-сервер TUIC может принять извне (в байтах)

source: Set if the listening socket should be dual-stack
ru: Установить, должен ли сокет прослушивания быть двустековым (dual-stack)

source: <br />none: default, no masquerade, data sent is packets with no characteristics.<br />srtp: disguised as an SRTP packet, it will be recognized as video call data (such as FaceTime).<br />utp: packets disguised as uTP will be recognized as bittorrent downloaded data.<br />wechat-video: packets disguised as WeChat video calls.<br />dtls: disguised as DTLS 1.2 packet.<br />wireguard: disguised as a WireGuard packet. (not really WireGuard protocol)<br />dns: Disguising traffic as DNS requests.
ru: <br />none: по умолчанию, без маскировки, отправляются пакеты без характеристик.<br />srtp: маскируется под SRTP-пакет, будет распознан как данные видеозвонка (например, FaceTime).<br />utp: пакеты, замаскированные под uTP, будут распознаны как данные загрузки через BitTorrent.<br />wechat-video: пакеты, замаскированные под видеозвонки WeChat.<br />dtls: маскируется под пакет DTLS 1.2.<br />wireguard: маскируется под пакет WireGuard (не настоящий протокол WireGuard).<br />dns: маскировка трафика под DNS-запросы.

source: Use it together with the DNS disguised type. You can fill in any domain.
ru: Используется вместе с типом маскировки 'DNS'. Можно ввести любой домен.

source: Auth
ru: Аутентификация

source: Socks for authentication
ru: Способ аутентификации Socks

source: Socks protocol authentication, support anonymous and password.
ru: Аутентификация протокола Socks, поддерживает анонимный режим и по логину/паролю.

source: anonymous
ru: анонимный

source: User Password
ru: Логин/Пароль

source: Username and Password must be used together!
ru: Имя пользователя и пароль должны использоваться вместе!

source: Firewall tools
ru: Инструменты фаервола

source: IPv6 TProxy
ru: Прозрачный прокси IPv6 (TProxy)

source: Experimental feature. Make sure that your node supports IPv6.
ru: Экспериментальная функция. Убедитесь, что ваш узел поддерживает IPv6.

source: Status info
ru: Информация о статусе

source: Big icon
ru: Большая иконка

source: Show node check
ru: Показывать проверку узла

source: Show Show IP111
ru: Показывать IP111

source: Destination protocol
ru: Целевой протокол

source: Destination address
ru: Целевой адрес

source: Destination port
ru: Целевой порт

source: Whether to receive PROXY protocol, when this node want to be fallback or forwarded by proxy, it must be enable, otherwise it cannot be used.
ru: Принимать ли PROXY protocol. Должно быть включено, если этот узел используется как резервный (fallback) или перенаправляется через прокси, иначе не будет работать.

source: outbound node
ru: исходящий узел

source: Custom Socks
ru: Пользовательский Socks

source: Custom HTTP
ru: Пользовательский HTTP

source: Custom Interface
ru: Пользовательский интерфейс

source: Interface
ru: Интерфейс

source: Bind Local
ru: Привязать к localhost

source: When selected, it can only be accessed localhost.
ru: Если выбрано, доступен только с локального хоста.

source: Accept LAN Access
ru: Принимать доступ из LAN

source: When selected, it can accessed lan , this will not be safe!
ru: Если выбрано, доступен из локальной сети, это небезопасно! (Не рекомендуется, кроме особых случаев)

source: Enable Remote
ru: Включить переадресацию

source: You can forward to Nginx/Caddy/V2ray/Xray WebSocket and more.
ru: Вы можете перенаправлять на Nginx/Caddy/V2ray/Xray WebSocket и другие.

source: Remote Address
ru: Удалённый адрес

source: Remote Port
ru: Удалённый порт

source: as:
ru: например:

source: Public key absolute path
ru: Абсолютный путь к файлу публичного ключа

source: Private key absolute path
ru: Абсолютный путь к файлу приватного ключа

source: Can't find this file!
ru: Не удаётся найти этот файл!

source: Public key and Private key path can not be empty!
ru: Пути к файлам публичного и приватного ключей не могут быть пустыми!

source: Server-Side
ru: Серверная часть

source: Server Config
ru: Конфигурация сервера

source: Users Manager
ru: Управление пользователями

source: Logs
ru: Логи

source: Log
ru: Лог

source: Enable Node Log
ru: Включить лог узла

source: Log Level
ru: Уровень логирования

source: Not enabled log
ru: Логирование не включено

source: UDP Forward
ru: Переадресация UDP

source: DNS Settings
ru: Настройки DNS

source: Null
ru: Нет

source: You did not fill in the %s path. Please save and apply then update manually.
ru: Вы не указали путь для %s. Пожалуйста, сохраните и примените настройки, затем обновите вручную.

source: Not installed %s, Can't unzip!
ru: %s не установлен, невозможно распаковать!

source: Can't determine ARCH, or ARCH not supported.
ru: Не удалось определить ARCH или ARCH не поддерживается.

source: Get remote version info failed.
ru: Не удалось получить информацию о удалённой версии.

source: New version found, but failed to get new version download url.
ru: Найдена новая версия, но не удалось получить URL для её загрузки.

source: Download url is required.
ru: Необходимо указать URL для загрузки.

source: File download failed or timed out: %s
ru: Скачивание файла не удалось или превышено время ожидания: %s

source: File path required.
ru: Необходимо указать путь к файлу.

source: %s not enough space.
ru: Недостаточно места в %s.

source: Can't find client in file: %s
ru: Не удалось найти клиент в файле: %s

source: Client file is required.
ru: Необходимо указать файл клиента.

source: The client file is not suitable for current device.
ru: Файл клиента не подходит для текущего устройства.

source: Can't move new file to path: %s
ru: Не удалось переместить новый файл в: %s

source: An XHttpObject in JSON format, used for sharing.
ru: XHttpObject в формате JSON, используется для分享.

source: Enable Mux.Cool
ru: Включить Mux.Cool

source: Mux concurrency
ru: Максимум одновременных подключений

source: XUDP Mux concurrency
ru: Максимум одновременных XUDP-подключений

source: Padding
ru: Дополнение (padding)

source: Enable early data
ru: Включить ранние данные (0-RTT)

source: Early data length
ru: Максимальная длина ранних данных

source: Early data header name
ru: Имя HTTP-заголовка для ранних данных

source: Recommended value: Sec-WebSocket-Protocol
ru: Рекомендуемое значение: Sec-WebSocket-Protocol

source: Health check
ru: Проверка здоровья

source: Health check timeout
ru: Таймаут проверки здоровья

source: Permit without stream
ru: Разрешить проверку здоровья без подключаний

source: Initial Windows Size
ru: Начальный размер окна

source: Excluded Domains
ru: Исключённые домены

source: If the traffic sniffing result is in this list, the destination address will not be overridden.
ru: Если результат сниффинга трафика находится в этом списке, целевой адрес не будет переопределён.

source: Buffer Size
ru: Размер буфера

source: Buffer size for every connection (kB)
ru: Размер буфера для каждого соединения (кБ)

source: Custom geoip Path
ru: Пользовательский путь к geoip

source: Custom geoip URL
ru: Пользовательский URL для обновления geoip

source: Custom geosite Path
ru: Пользовательский путь к geosite

source: Custom geosite URL
ru: Пользовательский URL для обновления geosite

source: Handshake Timeout
ru: Таймаут квитирования

source: Idle Timeout
ru: Таймаут простоя

source: Hop Interval
ru: Интервал смены порта

source: HeartbeatPeriod(second)
ru: Период heartbeat (секунды)

source: Remove resource files
ru: Удалить ресурсные файлы

source: Sing-Box will automatically download resource files when starting, you can use this feature achieve upgrade resource files.
ru: Sing-Box автоматически загружает ресурсные файлы при запуске. Вы можете использовать эту функцию для их обновления.

source: Override the connection destination address
ru: Переопределить целевой адрес соединения

source: Override the connection destination address with the sniffed domain.<br />Otherwise use sniffed domain for routing only.<br />If using shunt nodes, configure the domain shunt rules correctly.
ru: Переопределять целевой адрес соединения доменом, полученным при сниффинге.<br />В противном случае домен используется только для маршрутизации.<br />При использовании узлов разделения трафика правильно настройте правила для доменов.

source: Override the connection destination address with the sniffed domain.<br />When enabled, traffic will match only by domain, ignoring IP rules.<br />If using shunt nodes, configure the domain shunt rules correctly.
ru: Переопределять целевой адрес соединения доменом, полученным при сниффинге.<br />При включении трафик будет сопоставляться только по доменам, игнорируя IP-правила.<br />При использовании узлов разделения трафика правильно настройте правила для доменов.

source: Handshake Server
ru: Сервер квитирования

source: Handshake Server Port
ru: Порт сервера квитирования

source: Protocol parameter. Will waste traffic randomly if enabled.
ru: Параметр протокола. При включении будет случайным образом расходовать трафик.

source: Protocol parameter. Enable length block encryption.
ru: Параметр протокола. Включить блочное шифрование по длине.

source: ECH Config
ru: Конфигурация ECH

source: ECH Key
ru: Ключ ECH

source: PQ signature schemes
ru: Постквантовые схемы подписи сертификатов

source: Disable adaptive sizing of TLS records
ru: Отключить адаптивное изменение размера записей TLS
