Repository: gooog1111/luci-i18n-openwrt-passwall2-ru
Catalog: passwall2.*.po
Languages: ru

source: ECH Query Policy
ru: Политика запроса ECH

source: Controls the policy used when performing DNS queries for ECH configuration.
ru: Определяет политику, используемую при выполнении DNS-запросов для получения конфигурации ECH.

source: Enable Multipath TCP, need to be enabled in both server and client configuration.
ru: Включить Multipath TCP, должно быть включено в конфигурации и сервера, и клиента.

source: Fragment
ru: Фрагментация

source: TCP fragments, which can deceive the censorship system in some cases, such as bypassing SNI blacklists.
ru: Фрагментация TCP, которая в некоторых случаях может обмануть систему цензуры, например, обходя чёрные списки SNI.

source: Fragment Packets
ru: Способ фрагментации

source: "1-3" is for segmentation at TCP layer, applying to the beginning 1 to 3 data writes by the client. "tlshello" is for TLS client hello packet fragmentation.
ru: "1-3" — это сегментация на уровне TCP, применяется к первым 1-3 операциям записи данных клиентом. "tlshello" — это фрагментация пакета TLS Client Hello.

source: Fragment Length
ru: Длина фрагмента

source: Fragmented packet length (byte)
ru: Длина фрагментированного пакета (байт)

source: Fragment Interval
ru: Интервал фрагментации

source: Fragmentation interval (ms)
ru: Интервал фрагментации (мс)

source: Max Split
ru: Макс. количество фрагментов

source: Limit the maximum number of splits.
ru: Ограничить максимальное количество фрагментов.

source: Split handshake data into multiple TLS records for better censorship evasion. Low overhead. Recommended to enable first.
ru: Разделяет данные квитирования на несколько записей TLS для лучшего обхода цензуры. Низкие накладные расходы. Рекомендуется включить в первую очередь.

source: Split handshake into multiple TCP segments. Enhances obfuscation. May increase delay. Use only if needed.
ru: Разделяет TLS-квитирование на несколько TCP-сегментов. Улучшает маскировку. Может увеличить задержку. Используйте только при необходимости.

source: Noise
ru: Шум

source: UDP noise, Under some circumstances it can bypass some UDP based protocol restrictions.
ru: UDP-шум. В некоторых обстоятельствах может обходить ограничения, основанные на UDP.

source: To send noise packets, select "Noise" in Xray Settings.
ru: Чтобы отправлять шумовые пакеты, выберите "Noise" в настройках Xray.

source: Xray Noise Packets
ru: Шумовые пакеты Xray

source: Packet
ru: Пакет

source: Delay (ms)
ru: Задержка (мс)

source: IP Type
ru: Тип IP

source: If is domain name, The requested domain name will be resolved to IP before connect.
ru: Если указано доменное имя, оно будет разрешено в IP-адрес перед подключением.

source: Chain Proxy
ru: Цепочка прокси

source: Landing Node
ru: Конечный узел (Landing Node)

source: Only support a layer of proxy.
ru: Поддерживается только один уровень прокси.

source: Chained proxy works only with Xray or Sing-box nodes.<br>The chained node must be the same type as your subscription node (Xray with Xray, Sing-box with Sing-box).<br>You can only use manual or imported nodes as chained nodes.
ru: Цепочка прокси работает только с узлами Xray или Sing-box.<br>Узел в цепочке должен быть того же типа, что и узел подписки (Xray с Xray, Sing-box с Sing-box).<br>В качестве узлов цепочки можно использовать только узлы, добавленные вручную или импортированные.

source: Set the default domain resolution strategy for the sing-box node.
ru: Установить стратегию разрешения доменных имён по умолчанию для узла sing-box.

source: Prefer IPv4
ru: Предпочитать IPv4

source: Prefer IPv6
ru: Предпочитать IPv6

source: IPv4 Only
ru: Только IPv4

source: IPv6 Only
ru: Только IPv6

source: Maintain
ru: Обслуживание

source: Backup and Restore
ru: Резервная копия и восстановление

source: Backup or Restore Client and Server Configurations.
ru: Создание резервной копии или восстановление конфигураций клиента и сервера.

source: Note: Restoring configurations across different versions may cause compatibility issues.
ru: Внимание: Восстановление конфигураций между разными версиями может вызвать проблемы совместимости.

source: Create Backup File
ru: Создать файл резервной копии

source: Restore Backup File
ru: Восстановить из резервной копии

source: DL Backup
ru: Скачать рез. копию

source: RST Backup
ru: Восст. из рез. копии

source: Backup failed!
ru: Создание резервной копии не удалось!

source: UL Restore
ru: Загрузить для восстановления

source: CLOSE WIN
ru: ЗАКРЫТЬ ОКНО

source: Restore to default configuration
ru: Восстановить конфигурацию по умолчанию

source: Do Reset
ru: Выполнить сброс

source: Please select a file first.
ru: Пожалуйста, сначала выберите файл.

source: Invalid file type. Please upload a .tar.gz file.
ru: Неверный тип файла. Пожалуйста, загрузите файл .tar.gz.

source: File size exceeds 10MB limit.
ru: Размер файла превышает лимит 10 МБ.

source: Do you want to restore the client to default settings?
ru: Вы хотите восстановить настройки клиента по умолчанию?

source: Are you sure you want to restore the client to default settings?
ru: Вы уверены, что хотите восстановить настройки клиента по умолчанию?

source: Configuration file uploaded successfully…
ru: Файл конфигурации успешно загружен…

source: Configuration restored successfully…
ru: Конфигурация успешно восстановлена…

source: Service restarting…
ru: Перезапуск службы…

source: Configuration file decompression failed, please try again!
ru: Распаковка файла конфигурации не удалась, попробуйте ещё раз!

source: URLTest node list
ru: Список узлов URLTest

source: List of nodes to test, <a target='_blank' href='https://sing-box.sagernet.org/configuration/outbound/urltest'>document</a>
ru: Список узлов для тестирования, <a target='_blank' href='https://sing-box.sagernet.org/configuration/outbound/urltest'>документация</a>

source: Test interval
ru: Интервал тестирования

source: Test interval must be less or equal than idle timeout.
ru: Интервал тестирования должен быть меньше или равен таймауту простоя.

source: Test tolerance
ru: Допуск тестирования

source: The test tolerance in milliseconds.
ru: Допуск тестирования в миллисекундах.

source: Idle timeout
ru: Таймаут простоя

source: The idle timeout.
ru: Таймаут простоя.

source: Interrupt existing connections
ru: Обрывать существующие соединения

source: Interrupt existing connections when the selected outbound has changed.
ru: Обрывать существующие соединения при изменении выбранного исходящего узла.

source: Port hopping range
ru: Диапазон смены портов

source: Format as 1000:2000 or 1000-2000 Multiple groups are separated by commas (,).
ru: Формат: 1000:2000 или 1000-2000. Несколько групп разделяются запятыми (,).

source: Use Custom Config
ru: Использовать пользовательскую конфигурацию

source: Custom Config
ru: Пользовательская конфигурация

source: Must be JSON text!
ru: Должен быть текст в формате JSON!

source: Geo View
ru: Geo-запросы

source: Query
ru: Запрос

source: Querying
ru: Выполняется запрос

source: Please enter query content!
ru: Пожалуйста, введите данные для запроса!

source: No results were found!
ru: Результатов не найдено!

source: Domain/IP Query
ru: Запрос домена/IP

source: GeoIP/Geosite Query
ru: Запрос GeoIP/Geosite

source: Enter a domain or IP to query the Geo rule list they belong to.
ru: Введите домен или IP, чтобы запросить список Geo-правил, к которым они принадлежат.

source: Enter a GeoIP or Geosite to extract the domains/IPs they contain. Format: geoip:cn or geosite:gfw
ru: Введите GeoIP или Geosite, чтобы извлечь содержащиеся в них домены/IP. Формат: geoip:cn или geosite:gfw

source: Tips:
ru: Подсказки:

source: By entering a domain or IP, you can query the Geo rule list they belong to.
ru: Вводя домен или IP, можно узнать, к каким Geo-правилам они относятся.

source: By entering a GeoIP or Geosite, you can extract the domains/IPs they contain.
ru: Вводя GeoIP или Geosite, можно извлечь содержащиеся в них домены/IP.

source: Use the GeoIP/Geosite query function to verify if the entered Geo rules are correct.
ru: Используйте функцию запроса GeoIP/Geosite, чтобы проверить корректность введённых Geo-правил.

source: Private Key Passphrase
ru: Парольная фраза для приватного ключа

source: Host Key
ru: Ключ хоста

source: Accept any if empty.
ru: Принимать любой, если пусто.

source: Host Key Algorithms
ru: Алгоритмы ключа хоста

source: Client Version
ru: Версия клиента

source: Random version will be used if empty.
ru: Если пусто, будет использована случайная версия.

source: The configured type also applies to the core specified when manually importing nodes.
ru: Настроенный тип также применяется к ядру, указанному при ручном импорте узлов.

source: Group Name
ru: Имя группы

source: Using...
ru: Используется...

source: Generate configuration file and run
ru: Сгенерировать файл конфигурации и запустить

source: Start after a delay of %s seconds!
ru: Запуск через %s секунд!

source: The script is already running, do not run it again. Exit.
ru: Скрипт уже работает, повторный запуск не производится. Выход.

source: Stop the script and wait for a timeout, then exit without repeating the process.
ru: Остановка скрипта и ожидание таймаута, повторный запуск не производится. Выход.

source: %s Transparent proxy base dependencies %s Not installed...
ru: Базовые зависимости для прозрачного прокси %s %s не установлены...

source: %s does not have execute permissions and cannot be started: %s %s
ru: %s не имеет прав на выполнение и не может быть запущен: %s %s

source: %s not found, unable to start...
ru: %s не найден, невозможно запустить...

source: Socks node: [%s]%s is an invalid server address and cannot be started!
ru: Socks-узел: [%s]%s имеет недопустимый адрес сервера и не может быть запущен!

source: For some reason, the configuration for this Socks service has been lost, and its startup has been aborted!
ru: По какой-то причине конфигурация для этой Socks-службы была утеряна, её запуск прерван!

source: Socks node: [%s]%s, start failed %s:%s %s
ru: Socks-узел: [%s]%s, запуск не удался %s:%s %s

source: Socks node: [%s]%s, starting %s:%s
ru: Socks-узел: [%s]%s, запускается %s:%s

source: To enable experimental IPv6 transparent proxy (TProxy), please ensure your node and type support IPv6!
ru: Для включения экспериментального прозрачного прокси IPv6 (TProxy) убедитесь, что ваш узел и тип поддерживают IPv6!

source: Analyzing the node configuration of the Socks service...
ru: Анализ конфигурации узла для Socks-службы...

source: Log file is too long, clear it!
ru: Файл лога слишком большой, очистка!

source: The task is currently running automatically as a scheduled task; no reconfiguration of the scheduled task is required.
ru: Задача в настоящее время выполняется автоматически как запланированная; перенастройка расписания не требуется.

source: Scheduled tasks: Auto stop service.
ru: Настройка запланированной задачи: автоматическая остановка службы.

source: Scheduled tasks: Auto start service.
ru: Настройка запланированной задачи: автоматический запуск службы.

source: Scheduled tasks: Auto restart service.
ru: Настройка запланированной задачи: автоматическая перезагрузка службы.

source: Scheduled tasks: Auto update rules.
ru: Настройка запланированной задачи: автоматическое обновление правил.

source: Scheduled tasks: Auto update [%s] subscription.
ru: Настройка запланированной задачи: автоматическое обновление подписки [%s].

source: Auto updates: Starts a cyclical update process.
ru: Автообновления: запускает циклический процесс обновления.

source: Running in no proxy mode, it only allows scheduled tasks for starting and stopping services.
ru: Работает в режиме без прокси, разрешены только запланированные задачи для запуска и остановки служб.

source: Clear scheduled commands.
ru: Очистить запланированные команды.

source: Unable to resolve [%s], route table addition failed!
ru: Не удалось разрешить [%s], добавление в таблицу маршрутизации не удалось!

source: [%s] was successfully added to the routing table of interface [%s]!
ru: [%s] успешно добавлен в таблицу маршрутизации интерфейса [%s]!

source: Adding [%s] to the [%s] routing table failed! The reason is that the [%s] gateway cannot be found.
ru: Добавление [%s] в таблицу маршрутизации [%s] не удалось! Причина: не удалось найти шлюз [%s].

source: Global nodes are not enabled, skip [%s].
ru: Глобальные узлы не включены, пропускаем [%s].

source: Direct DNS: %s
ru: Прямой DNS: %s

source: Remote DNS: %s
ru: Удалённый DNS: %s

source: The program has started. Please stop it and then restart it!
ru: Программа уже запущена. Пожалуйста, остановите её, а затем перезапустите!

source: The system does not have iptables or ipset installed, or Dnsmasq does not have ipset support enabled, so iptables+ipset transparent proxy cannot be used!
ru: В системе не установлены iptables или ipset, или в Dnsmasq не включена поддержка ipset, поэтому прозрачный прокси на iptables+ipset использовать нельзя!

source: fw4 detected, use nftables to transparent proxy.
ru: Обнаружен fw4, используется nftables для прозрачного прокси.

source: The Dnsmasq package does not meet the requirements for transparent proxy in nftables. If you need to use it, please ensure that the dnsmasq version is 2.87 or higher and that nftset support is enabled.
ru: Пакет Dnsmasq не удовлетворяет требованиям для прозрачного прокси в nftables. Если вам нужно его использовать, убедитесь, что версия dnsmasq не ниже 2.87 и поддержка nftset включена.

source: If your Dnsmasq version is lower than 2.90, it is recommended to upgrade to version 2.90 or higher to avoid Dnsmasq crashing in some cases!
ru: Если ваша версия Dnsmasq ниже 2.90, рекомендуется обновить до версии 2.90 или выше, чтобы избежать сбоев Dnsmasq в некоторых случаях!

source: Running complete!
ru: Выполнение завершено!

source: Clearing and closing related programs and cache complete.
ru: Очистка и закрытие связанных программ и кэша завершены.

source: Incorrect index listing method (%s), execution terminated!
ru: Некорректный метод перечисления индексов (%s), выполнение прервано!

source: parse the traffic splitting rules[%s]-[geoip:%s] add to %s to complete.
ru: Разбор правил разделения трафика [%s]-[geoip:%s] и добавление в %s завершено.

source: Access Control:
ru: Контроль доступа:

source: Add node to the load balancer is directly connected to %s[%s].
ru: Добавление узла в балансировщик нагрузки и прямое подключение к %s[%s] завершено.

source: Add all %s nodes to %s[%s] direct connection complete.
ru: Добавление всех узлов %s в прямое подключение %s[%s] завершено.

source: Starting to load %s firewall rules...
ru: Начало загрузки правил фаервола %s...

source: local network segments (%s) direct connection: %s
ru: Прямое подключение сегментов локальной сети %s: %s

source: Add ISP %s DNS to the whitelist: %s
ru: Добавление DNS провайдера %s в белый список: %s

source: Source iface [%s],
ru: Исходный интерфейс【%s】，

source: IP range [%s],
ru: Диапазон IP【%s】，

source: All device,
ru: Все устройства，

source: Does not exist, ignore.
ru: Не существует, игнорировать.

source: not proxy %s port [%s]
ru: Не проксировать %s порт [%s]

source: not proxy all %s
ru: Не проксировать все %s

source: Use the %s node [%s]
ru: Использовать узел %s [%s]

source: Using a node that is different from the global configuration, DNS has been forcibly redirected to a dedicated DNS server.
ru: Используется узел, отличный от глобальной конфигурации, DNS принудительно перенаправлен на выделенный DNS-сервер.

source: Add direct DNS to %s: %s
ru: Добавление прямого DNS в %s: %s

source: Local
ru: Локальный хост

source: [Local],
ru: 【Локальный хост】，

source: Clear %s.
ru: Очистить %s.

source: Delete %s rules is complete.
ru: Удаление правил %s завершено.

source: %s firewall rules load complete!
ru: Загрузка правил фаервола %s завершена!

source: Socks switch detection: Unknown error.
ru: Обнаружение переключения Socks: Неизвестная ошибка.

source: Socks switch detection: Unable to connect to the network. Please check if the network is working properly!
ru: Обнаружение переключения Socks: Не удается подключиться к сети. Пожалуйста, проверьте, работает ли сеть нормально!

source: Socks switch detection: Primary node 【%s: [%s]】 is normal. Switch to the primary node!
ru: Обнаружение переключения Socks: Основной узел 【%s: [%s]】 в норме. Переключение на основной узел!

source: Socks switch detection: %s node switch complete!
ru: Обнаружение переключения Socks: Переключение на узел %s завершено!

source: Socks switch detection: %s 【%s:[%s]】 normal.
ru: Обнаружение переключения Socks: %s 【%s:[%s]】 нормально.

source: switch to %s test detect!
ru: Переключение на тестовое обнаружение %s!

source: backup node
ru: резервный узел

source: next backup node
ru: следующий резервный узел

source: main node
ru: основной узел

source: Socks switch detection: %s 【%s:[%s]】 abnormal, %s
ru: Обнаружение переключения Socks: %s 【%s:[%s]】 аномально, %s

source: Socks switch detection: %s 【%s:[%s]】 normal, switch to this node!
ru: Обнаружение переключения Socks: %s 【%s:[%s]】 нормально, переключение на этот узел!

source: Restart dnsmasq service.
ru: Перезапуск службы dnsmasq.

source: Console Port: %s
ru: Порт консоли: %s

source: Discard one obviously invalid node.
ru: Отброшен 1 явно недействительный узел.

source: Entrance %s:%s
ru: Вход %s:%s

source: Node: %s:%s, Weight: %s
ru: Узел: %s:%s, Вес: %s

source: Start updating the rules...
ru: Начало обновления правил...

source: %s Start updating...
ru: %s Начало обновления...

source: %s version is the same and does not need to be updated.
ru: Версия %s совпадает, обновление не требуется.

source: %s update success.
ru: %s обновление успешно.

source: %s update failed, please try again later.
ru: %s обновление не удалось, повторите попытку позже.

source: Restart the service and apply the new rules.
ru: Перезапуск службы для применения новых правил.

source: The rules have been updated...
ru: Правила обновлены...

source: Socks node list [%s]
ru: Список Socks-узлов [%s]

source: Backup node list
ru: Список резервных узлов

source: HAProxy node list [%s]
ru: Список узлов HAProxy [%s]

source: ACL list [%s]
ru: Список ACL [%s]

source: Shunt [%s] node
ru: Узел разделения трафика [%s]

source: Xray Load Balancing node [%s] list
ru: Список узлов балансировки нагрузки Xray [%s]

source: Xray Load Balancing node [%s] backup node
ru: Резервный узел балансировки нагрузки Xray [%s]

source: Sing-Box URLTest node [%s] list
ru: Список узлов Sing-Box URLTest [%s]

source: Node [%s] preproxy node
ru: Промежуточный прокси-узел для узла [%s]

source: Node [%s] landing node
ru: Конечный узел (Landing Node) для узла [%s]

source: Skipping the %s node is due to incompatibility with the %s core program or incorrect node usage type settings.
ru: Пропуск узла %s вызван несовместимостью с основной программой %s или некорректными настройками типа использования узла.

source: Skip node: %s. Because Sing-Box does not support the %s protocol's %s transmission method, Xray needs to be used instead.
ru: Пропуск узла: %s. Потому что Sing-Box не поддерживает метод передачи %s для протокола %s, требуется использовать Xray.

source: Xray unsupport %s plugin.
ru: Xray не поддерживает плагин %s.

source: Plugin options Incomplete.
ru: Неполные опции плагина.

source: shadowsocks-libev unsupport 2022 encryption.
ru: shadowsocks-libev не поддерживает шифрование 2022 года.

source: Please replace Xray or Sing-Box to support more transmission methods in Shadowsocks.
ru: Пожалуйста, замените на Xray или Sing-Box для поддержки большего количества методов передачи в Shadowsocks.

source: unsupport %s plugin.
ru: не поддерживается плагин %s.

source: Skip the %s node because the %s core program is not installed.
ru: Пропуск узла %s, потому что основная программа %s не установлена.

source: Skip the %s node, as %s type nodes require Sing-Box version 1.12 or higher.
ru: Пропуск узла %s, так как узлы типа %s требуют Sing-Box версии 1.12 или выше.

source: %s type node subscriptions are not currently supported, skip this node.
ru: Подписки на узлы типа %s в настоящее время не поддерживаются, пропуск этого узла.

source: Update [%s]
ru: Обновление【%s】

source: Matching node:
ru: Соответствующий узел:

source: First Matching node:
ru: Первый соответствующий узел:

source: Second Matching node:
ru: Второй соответствующий узел:

source: Third Matching node:
ru: Третий соответствующий узел:

source: Fourth Matching node:
ru: Четвёртый соответствующий узел:

source: Fifth Matching node:
ru: Пятый соответствующий узел:

source: Unable to find the best matching node, now replaced with:
ru: Не удалось найти наилучший соответствующий узел, теперь заменён на:

source: No node information updates are available.
ru: Обновлений информации об узлах нет.

source: Skip unknown types:
ru: Пропуск неизвестных типов:

source: Discard node: %s, Reason:
ru: Отброшен узел: %s, Причина:

source: No usable binary was found.
ru: Не найдено пригодного для использования бинарного файла.

source: Discard filter nodes: %s type node %s
ru: Отброшены узлы по фильтру: узел типа %s %s

source: Parsing error, skip this node.
ru: Ошибка разбора, пропуск этого узла.

source: Successfully resolved the [%s] node, number: %s
ru: Успешно разрешён узел [%s], количество: %s

source: Get subscription content for [%s] is empty. This may be due to an invalid subscription address or a network problem. Please diagnose the issue!
ru: Полученное содержимое подписки для [%s] пусто. Это может быть из-за недействительного адреса подписки или проблемы с сетью. Пожалуйста, проверьте!

source: Proxy
ru: Прокси

source: Start subscribing...
ru: Начало подписки...

source: Start subscribing: %s
ru: Начало подписки: %s

source: Subscription: [%s] No changes, no update required.
ru: Подписка: [%s] Изменений нет, обновление не требуется.

source: [%s] Subscription failed. This could be due to an invalid subscription address or a network issue. Please diagnose the problem! [%s]
ru: [%s] Подписка не удалась. Это может быть из-за недействительного адреса подписки или проблемы с сетью. Пожалуйста, проверьте! [%s]

source: Error, restoring service.
ru: Ошибка, восстановление службы.

source: Subscription complete...
ru: Подписка завершена...

source: When adding a new subscription, please save and apply before manually subscribing. If you only change the subscription URL, you can subscribe manually, and the system will save it automatically.
ru: При добавлении новой подписки, пожалуйста, сохраните ее и примените, прежде чем подписываться вручную. Если вы измените только URL-адрес подписки, вы можете подписаться вручную, и система сохранит его автоматически.
