Repository: gooog1111/luci-i18n-openwrt-passwall2-ru
Catalog: passwall2.*.po
Languages: ru

source: Auto
ru: Авто

source: RUNNING
ru: Запущено

source: NOT RUNNING
ru: Не запущено

source: Working...
ru: Соединение в норме

source: Problem detected!
ru: Соединение не установлено

source: Touch Check
ru: Проверить

source: Kernel Unsupported
ru: Ядро не поддерживается

source: Basic Settings
ru: Основные настройки

source: Node List
ru: Список узлов

source: Other Settings
ru: Дополнительные настройки

source: Load Balancing
ru: Балансировка нагрузки

source: Enter interface
ru: Войти в интерфейс

source: Rule Manage
ru: Управление правилами

source: Rule List
ru: Список правил

source: Access control
ru: Контроль доступа

source: Watch Logs
ru: Просмотр логов

source: Node Config
ru: Конфигурация узла

source: Running Status
ru: Статус работы

source: Baidu Connection
ru: Соединение с Baidu

source: Google Connection
ru: Соединение с Google

source: GitHub Connection
ru: Соединение с GitHub

source: Instagram Connection
ru: Соединение с Instagram

source: Node Check
ru: Проверка узла

source: Check...
ru: Проверка...

source: Clear
ru: Очистить

source: Main switch
ru: Главный переключатель

source: Node
ru: Узел

source: Edit Current Node
ru: Редактировать текущий узел

source: Localhost Proxy
ru: Прокси локального хоста (роутера)

source: When selected, localhost can transparent proxy.
ru: Если выбрано, локальный хост (роутер) будет использовать прозрачный прокси.

source: Client Proxy
ru: Прокси клиентов

source: When selected, devices in LAN can transparent proxy. Otherwise, it will not be proxy. But you can still use access control to allow the designated device to proxy.
ru: Если выбрано, устройства в локальной сети будут использовать прозрачный прокси. В противном случае проксироваться не будут. Но вы всё равно можете использовать контроль доступа, чтобы разрешить прокси для определённых устройств.

source: Socks Config
ru: Настройка Socks

source: Socks Node
ru: Узел Socks

source: Current Node
ru: Текущий узел

source: Listen Port
ru: Порт прослушивания

source: 0 is not use
ru: 0 означает 'не использовать'

source: Current node: %s
ru: Текущий узел: %s

source: IP:Port mode acceptable, multi value split with english comma.
ru: Допустим формат IP:Порт, несколько значений разделяются запятой.

source: Direct DNS Protocol
ru: Протокол прямого DNS

source: Direct DNS
ru: Прямой DNS

source: Direct DNS DoH
ru: Прямой DNS DoH

source: Direct DNS EDNS Client Subnet
ru: Прямой DNS EDNS Client Subnet

source: Remote DNS Protocol
ru: Протокол удалённого DNS

source: Remote DNS
ru: Удалённый DNS

source: Remote DNS DoH
ru: Удалённый DNS DoH

source: Remote DNS EDNS Client Subnet
ru: Удалённый DNS EDNS Client Subnet

source: Notify the DNS server when the DNS query is notified, the location of the client (cannot be a private IP address).
ru: Используется для уведомления DNS-сервера о местоположении клиента при DNS-запросе (не может быть приватным IP-адресом).

source: This feature requires the DNS server to support the Edns Client Subnet (RFC7871).
ru: Для работы этой функции DNS-сервер должен поддерживать EDNS Client Subnet (RFC7871).

source: Remote DNS Outbound
ru: Исходящий удалённый DNS

source: Remote
ru: Удалённый

source: Direct
ru: Прямой

source: Direct Query Strategy
ru: Стратегия прямых запросов

source: Remote Query Strategy
ru: Стратегия удалённых запросов

source: Use FakeDNS work in the domain that proxy.
ru: Использовать FakeDNS для доменов, идущих через прокси.

source: Domain Override
ru: Переопределение домена

source: Direct DNS result write to IPSet
ru: Записывать результаты прямого DNS в IPSet

source: Perform the matching direct domain name rules into IP to IPSet/NFTSet, and then connect directly (not entering the core). Maybe conflict with some special circumstances.
ru: Записывать IP-адреса, полученные в результате разрешения доменных имён, соответствующих правилам прямого доступа, в IPSet/NFTSet, и затем соединяться напрямую (не проходя через ядро). Может конфликтовать в некоторых особых случаях.

source: DNS Redirect
ru: Перенаправление DNS

source: Force special DNS server to need proxy devices.
ru: Принудительно использовать специальный DNS-сервер для устройств, которым нужен прокси.

source: Clear IPSET
ru: Очистить IPSET

source: Clear NFTSET
ru: Очистить NFTSET

source: Try this feature if the rule modification does not take effect.
ru: Попробуйте эту функцию, если изменения правил не вступают в силу.

source: About DNS issues:
ru: О проблемах с DNS:

source: Some browsers may have built-in DNS, be sure to close. Example: Chrome. Settings - Security and Privacy - Security - Use secure DNS disabled.
ru: Некоторые браузеры могут иметь встроенный DNS, обязательно отключите его. Например, в Chrome: Настройки -> Конфиденциальность и безопасность -> Безопасность -> Использовать безопасный DNS (отключить).

source: Sometimes after restart, you can not internet. At this time, close all browsers (important), Windows Client, please `ipconfig /flushdns`. Please close the WiFi on the phone, cut the flight mode and then cut back.
ru: Иногда после перезагрузки интернет может не работать. В этом случае закройте все браузеры (важно!), на Windows выполните `ipconfig /flushdns`. На телефоне отключите Wi-Fi, включите авиарежим и выключите его.

source: The client DNS and the default gateway must point to this router.
ru: DNS и шлюз по умолчанию на клиентских устройствах должны указывать на этот роутер.

source: If you have a wrong DNS process, the consequences are at your own risk!
ru: Если вы настроили неверный процесс DNS, последствия — на вашей ответственности!

source: Hide menu method, input example in the address bar:
ru: Способ скрыть меню, введите в адресной строке, например:

source: After the hidden to the display, input example in the address bar:
ru: Чтобы снова показать скрытое меню, введите в адресной строке, например:

source: Are you sure to hide?
ru: Вы уверены, что хотите скрыть?

source: DNS related issues:
ru: Проблемы, связанные с DNS:

source: Certain browsers such as Chrome have built-in DNS service, which may affect DNS resolution settings. You can go to 'Settings -> Privacy and security -> Use secure DNS' menu to turn it off.
ru: Некоторые браузеры, такие как Chrome, имеют встроенную DNS-службу, что может влиять на настройки DNS. Вы можете отключить это в меню 'Настройки -> Конфиденциальность и безопасность -> Использовать безопасный DNS'.

source: If you are unable to access the internet after reboot, please try clearing the cache of your terminal devices (make sure to close all open browser application windows first, this step is especially important):
ru: Если после перезагрузки у вас нет доступа в интернет, попробуйте очистить кэш на ваших устройствах (сначала закройте все окна браузера, этот шаг особенно важен):

source: For Windows systems, open Command Prompt and run the command 'ipconfig /flushdns'.
ru: Для Windows откройте Командную строку и выполните команду 'ipconfig /flushdns'.

source: For Mac systems, open Terminal and run the command 'sudo killall -HUP mDNSResponder'.
ru: Для Mac откройте Терминал и выполните команду 'sudo killall -HUP mDNSResponder'.

source: For mobile devices, you can clear it by reconnecting to the network, such as toggling Airplane Mode and reconnecting to WiFi.
ru: Для мобильных устройств можно очистить кэш, переподключившись к сети, например, включив и выключив авиарежим или переподключившись к Wi-Fi.

source: Please make sure your device's network settings point both the DNS server and default gateway to this router, to ensure DNS queries are properly routed.
ru: Убедитесь, что в сетевых настройках вашего устройства и DNS-сервер, и шлюз по умолчанию указывают на этот роутер, чтобы DNS-запросы правильно маршрутизировались.

source: Browser access:
ru: Доступ через браузер:

source: Hide in main menu:
ru: Скрыть в главном меню:

source: Show in main menu:
ru: Показать в главном меню:

source: DNS Export Of Multi WAN
ru: Принудительное использование WAN для локального DNS

source: Node Export Of Multi WAN
ru: Принудительное использование WAN для узла

source: Only support Multi Wan.
ru: Работает только при наличии нескольких WAN.

source: Not Specify
ru: Не указано

source: custom
ru: пользовательский

source: If not available, try clearing the cache.
ru: Если не работает, попробуйте очистить кэш.

source: Operation
ru: Действие

source: Add Node
ru: Добавить узел

source: Add the node via the link
ru: Добавить узел по ссылке

source: Enter share links, one per line. Subscription links are not supported!
ru: Введите ссылки на узлы, по одной на строку. Ссылки на подписки не поддерживаются!

source: Please enter the correct link.
ru: Пожалуйста, введите корректную ссылку.

source: Clear all nodes
ru: Очистить все узлы

source: Are you sure to clear all nodes?
ru: Вы уверены, что хотите очистить все узлы?

source: Error
ru: Ошибка

source: Delete select nodes
ru: Удалить выбранные узлы

source: To Top
ru: Наверх

source: Select
ru: Выбрать

source: DeSelect
ru: Снять выделение

source: Select all
ru: Выбрать все

source: DeSelect all
ru: Снять все выделения

source: Are you sure to delete select nodes?
ru: Вы уверены, что хотите удалить выбранные узлы?

source: You no select nodes !
ru: Вы не выбрали ни одного узла!

source: Are you sure set to
ru: Вы уверены, что хотите установить

source: the server?
ru: в качестве сервера?

source: You choose node is:
ru: Выбранный вами узел:

source: Timeout
ru: Таймаут

source: Node Remarks
ru: Примечание к узлу

source: Add Mode
ru: Способ добавления

source: Type
ru: Тип

source: _balancing
ru: балансировка_нагрузки

source: _shunt
ru: разделение_трафика

source: Balancing
ru: Балансировка нагрузки

source: Balancing Strategy
ru: Стратегия балансировки

source: Fallback Node
ru: Резервный узел

source: Use Custom Probe URL
ru: Использовать свой URL для проверки

source: By default the built-in probe URL will be used, enable this option to use a custom probe URL.
ru: По умолчанию используется встроенный URL для проверки. Включите эту опцию, чтобы использовать свой URL.

source: Probe URL
ru: URL для проверки

source: The URL used to detect the connection status.
ru: URL, используемый для проверки статуса соединения.

source: Probe Interval
ru: Интервал проверки

source: The interval between initiating probes.
ru: Интервал между запусками проверок.

source: The time format is numbers + units, such as '10s', '2h45m', and the supported time units are <code>s</code>, <code>m</code>, <code>h</code>, which correspond to seconds, minutes, and hours, respectively.
ru: Формат времени: число + единица измерения, например, '10s', '2h45m'. Поддерживаемые единицы: <code>s</code> (секунды), <code>m</code> (минуты), <code>h</code> (часы).

source: When the unit is not filled in, it defaults to seconds.
ru: Если единица измерения не указана, по умолчанию используются секунды.

source: Preferred Node Count
ru: Количество предпочитаемых узлов

source: The load balancer selects the optimal number of nodes, and traffic is randomly distributed among them.
ru: Балансировщик нагрузки выбирает оптимальное количество узлов, и трафик распределяется между ними случайным образом.

source: Shunt
ru: Разделение трафика

source: Preproxy
ru: Промежуточный прокси

source: Preproxy Node
ru: Узел промежуточного прокси

source: Set the node to be used as a pre-proxy. Each rule (including <code>Default</code>) has a separate switch that controls whether this rule uses the pre-proxy or not.
ru: Задайте узел, используемый в качестве промежуточного прокси. Для каждого правила (включая <code>По умолчанию</code>) есть отдельный переключатель, управляющий использованием промежуточного прокси.

source: Direct Connection
ru: Прямое соединение

source: Blackhole
ru: Чёрная дыра

source: Default Preproxy
ru: Промежуточный прокси по умолчанию

source: There are no available nodes, please add or subscribe nodes first.
ru: Нет доступных узлов, пожалуйста, сначала добавьте или подпишитесь на узлы.

source: No shunt rules? Click me to go to add.
ru: Нет правил разделения трафика? Нажмите сюда, чтобы добавить.

source: When using, localhost will connect this node first and then use this node to connect the default node.
ru: При использовании локальный хост сначала подключится к этому узлу, а затем использует его для подключения к узлу по умолчанию.

source: Domain Strategy
ru: Стратегия для доменов

source: Domain matcher
ru: Алгоритм сопоставления доменов

source: 'AsIs': Only use domain for routing. Default value.
ru: 'AsIs': Использует только домен для маршрутизации. Значение по умолчанию.

source: 'IPIfNonMatch': When no rule matches current domain, resolves it into IP addresses (A or AAAA records) and try all rules again.
ru: 'IPIfNonMatch': Если ни одно правило не соответствует домену, преобразует его в IP-адрес (записи A или AAAA) и снова проверяет все правила.

source: 'IPOnDemand': As long as there is a IP-based rule, resolves the domain into IP immediately.
ru: 'IPOnDemand': Как только встречается правило на основе IP, немедленно преобразует домен в IP-адрес для сопоставления.

source: Load balancing node list
ru: Список узлов для балансировки нагрузки

source: Load balancing node list, <a target='_blank' href='https://xtls.github.io/config/routing.html#balancerobject'>document</a>
ru: Список узлов для балансировки нагрузки, <a target='_blank' href='https://xtls.github.io/config/routing.html#balancerobject'>документация</a>

source: From Share URL
ru: Импорт из URL

source: Build Share URL
ru: Создать URL для分享

source: Generate QRCode
ru: Сгенерировать QR-код

source: Export Config File
ru: Экспорт файла конфигурации

source: Import Finished
ru: Импорт завершён:

source: Not a supported scheme:
ru: Неподдерживаемая схема:

source: Invalid Share URL Format
ru: Неверный формат URL для分享

source: Paste Share URL Here
ru: Вставьте URL для分享 сюда

source: Share URL to clipboard unable.
ru: Не удалось скопировать URL в буфер обмена.

source: Share URL to clipboard successfully.
ru: URL успешно скопирован в буфер обмена.

source: Faltal on get option, please help in debug:
ru: Критическая ошибка при получении опции, помогите в отладке:

source: Faltal on set option, please help in debug:
ru: Критическая ошибка при установке опции, помогите в отладке:

source: Address
ru: Адрес

source: Address (Support Domain Name)
ru: Адрес (поддерживается доменное имя)

source: Trojan Verify Cert
ru: Проверять сертификат

source: Trojan Cert Path
ru: Путь к сертификату

source: Finger Print
ru: Подделка отпечатка

source: Avoid using randomized, unless you have to.
ru: Избегайте использования 'randomized', если только это не необходимо.

source: Original
ru: Оригинальный

source: Transport Plugin
ru: Плагин транспорта

source: Shadowsocks secondary encryption
ru: Дополнительное шифрование Shadowsocks

source: Obfs Type
ru: Тип обфускации

source: Obfs Password
ru: Пароль обфускации

source: Auth Type
ru: Тип аутентификации

source: Auth Password
ru: Пароль аутентификации

source: Commands the client to use the BBR flow control algorithm
ru: Предписывает клиенту использовать алгоритм управления потоком BBR

source: Certificate fingerprint
ru: Отпечаток сертификата

source: Max upload Mbps
ru: Макс. исходящая скорость (Мбит/с)

source: Max download Mbps
ru: Макс. входящая скорость (Мбит/с)

source: QUIC stream receive window
ru: Окно приёма QUIC-потока

source: QUIC connection receive window
ru: Окно приёма QUIC-соединения

source: QUIC concurrent bidirectional streams
ru: Макс. количество одновременных двунаправленных QUIC-потоков

source: Disable MTU detection
ru: Отключить обнаружение MTU

source: ignoreClientBandwidth
ru: игнорировать настройки пропускной способности клиента

source: Lazy Start
ru: Отложенный запуск

source: Encrypt Method
ru: Метод шифрования

source: Encrypt Key
ru: Ключ шифрования

source: Latency
ru: Задержка

source: Automatic detection delay
ru: Автоматическое определение задержки

source: Show server address and port
ru: Показать адрес и порт сервера

source: URL Test
ru: Проверка URL

source: Test
ru: Тест

source: Node num
ru: Количество узлов

source: Self add
ru: Добавлено вручную

source: Apply
ru: Применить

source: Use
ru: Использовать

source: Copy
ru: Копировать

source: Delay Settings
ru: Настройки расписания

source: Open and close Daemon
ru: Запустить/остановить демон

source: Delay Start
ru: Отложенный запуск при загрузке

source: Units:seconds
ru: Единица: секунды

source: Units:minutes
ru: Единица: минуты

source: stop automatically mode
ru: режим автоматического отключения

source: stop Time(Every day)
ru: Время отключения (ежедневно)

source: stop Interval(Hour)
ru: Интервал отключения (часы)

source: start automatically mode
ru: режим автоматического включения

source: start Time(Every day)
ru: Время включения (ежедневно)

source: start Interval(Hour)
ru: Интервал включения (часы)

source: restart automatically mode
ru: режим автоматической перезагрузки

source: restart Time(Every day)
ru: Время перезагрузки (ежедневно)

source: restart Interval(Hour)
ru: Интервал перезагрузки (часы)

source: Forwarding Settings
ru: Настройки переадресации

source: TCP No Redir Ports
ru: Порты, НЕ перенаправляемые для TCP

source: UDP No Redir Ports
ru: Порты, НЕ перенаправляемые для UDP

source: Fill in the ports you don't want to be forwarded by the agent, with the highest priority.
ru: Укажите порты, которые вы НЕ хотите перенаправлять через прокси. Имеет наивысший приоритет.

source: If you don't want to let the device in the list to go proxy, please choose all.
ru: Если вы не хотите, чтобы устройства из списка использовали прокси, выберите 'Все'.

source: The port settings support single ports and ranges.<br>Separate multiple ports with commas (,).<br>Example: 21,80,443,1000:2000.
ru: Настройки портов поддерживают одиночные порты и диапазоны.<br>Несколько портов разделяются запятыми.<br>Пример: 21,80,443,1000:2000.

source: TCP Proxy Drop Ports
ru: Заблокированные порты для TCP-прокси

source: UDP Proxy Drop Ports
ru: Заблокированные порты для UDP-прокси

source: TCP Redir Ports
ru: Перенаправляемые порты TCP

source: UDP Redir Ports
ru: Перенаправляемые порты UDP

source: No patterns are used
ru: Не используется

source: All
ru: Все

source: Common Use
ru: Обычно используемые

source: Only Web
ru: Только веб

source: or more
ru: и выше

source: or less
ru: и ниже

source: Default
ru: По умолчанию

source: Close
ru: Закрыть

source: Hijacking ICMP (PING)
ru: Перехват ICMP (PING)

source: Hijacking ICMPv6 (IPv6 PING)
ru: Перехват ICMPv6 (IPv6 PING)

source: Sniffing
ru: Сниффинг трафика

source: TCP Proxy Way
ru: Способ TCP-прокси

source: Auto Switch
ru: Автопереключение

source: When there is no server, an automatic reconnect scheme is used
ru: Когда сервер недоступен, используется схема автоматического переподключения

source: How often to test
ru: Как часто проверять

source: Timeout seconds
ru: Таймаут в секундах

source: Timeout retry num
ru: Количество попыток при таймауте

source: Automatic switching cannot be used when this option is checked
ru: Когда эта опция включена, автопереключение недоступно

source: Main node
ru: Основной узел

source: List of backup nodes
ru: Список резервных узлов

source: Restore Switch
ru: Восстановить переключение

source: When detects main node is available, switch back to the main node.
ru: Когда основной узел снова доступен, переключиться обратно на него.

source: If the main node is shunt
ru: Если основной узел используется для разделения трафика

source: Switch it
ru: Переключить его

source: Applying to the default node
ru: Применяется к узлу по умолчанию

source: Applying to the default preproxy node
ru: Применяется к промежуточному прокси по умолчанию

source: Add nodes to the standby node list by keywords
ru: Добавить узлы в список резервных по ключевым словам

source: Delete nodes in the standby node list by keywords
ru: Удалить узлы из списка резервных по ключевым словам

source: Please enter the node keyword, pay attention to distinguish between spaces, uppercase and lowercase.
ru: Введите ключевое слово узла, учитывайте пробелы, регистр букв.

source: Enable Load Balancing
ru: Включить балансировку нагрузки

source: Console Login Auth
ru: Аутентификация в консоли

source: Console Username
ru: Имя пользователя консоли

source: Console Password
ru: Пароль консоли

source: Console Port
ru: Порт консоли

source: In the browser input routing IP plus port access, such as:192.168.1.1:1188
ru: В браузере введите IP-адрес роутера и порт, например: 192.168.1.1:1188

source: Haproxy Port
ru: Порт HAProxy

source: Health Check Type
ru: Тип проверки здоровья

source: Inner implement
ru: Встроенная реализация

source: Health Check Inter
ru: Интервал проверки здоровья узлов

source: When the URL test is used, the load balancing node will be converted into a Socks node. when node list set customizing, must be a Socks node, otherwise the health check will be invalid.
ru: При использовании проверки URL узел балансировки нагрузки преобразуется в Socks-узел. Если список узлов настраивается вручную, они должны быть Socks-узлами, иначе проверка здоровья будет недействительна.

source: Add a node, Export Of Multi WAN Only support Multi Wan. Load specific gravity range 1-256. Multiple primary servers can be load balanced, standby will only be enabled when the primary server is offline! Multiple groups can be set, Haproxy port same one for each group.
ru: Добавление узла. Функция 'Node Export Of Multi WAN' только для Multi WAN. Диапазон веса 1-256. Несколько основных серверов могут балансироваться, резервные включаются только при отказе основных! Можно настроить несколько групп; узлы с одинаковым портом HAProxy относятся к одной группе.

source: Note that the node configuration parameters for load balancing must be consistent when use TCP health check type, otherwise it cannot be used normally!
ru: Обратите внимание: при использовании проверки здоровья по TCP параметры конфигурации узлов для балансировки нагрузки должны быть согласованы, иначе нормальная работа невозможна!

source: Node Address
ru: Адрес узла

source: Node Port
ru: Порт узла

source: Node Weight
ru: Вес узла

source: Export Of Multi WAN
ru: Принудительное использование WAN

source: Main
ru: Основной

source: Mode
ru: Режим

source: Primary
ru: Основной

source: Standby
ru: Резервный

source: Check update
ru: Проверить обновления

source: Force update
ru: Принудительное обновление

source: The latest version: %s, currently does not support automatic update, if you need to update, please compile or download the ipk and then manually install.
ru: Последняя версия: %s. Автоматическое обновление пока не поддерживается. Если нужно обновиться, соберите сами или скачайте ipk и установите вручную.

source: Enable custom URL
ru: Включить пользовательский URL правил

source: Rule status
ru: Версия правил

source: Manually update
ru: Обновить вручную

source: Enable auto update rules
ru: Включить автоматическое обновление правил

source: Update Time(every day)
ru: Время обновления (ежедневно)

source: Update Interval(hour)
ru: Интервал обновления (часы)

source: Update Mode
ru: Режим обновления

source: Loop Mode
ru: Циклический

source: Every day
ru: Ежедневно

source: Every Monday
ru: Каждый понедельник

source: Every Tuesday
ru: Каждый вторник

source: Every Wednesday
ru: Каждую среду

source: Every Thursday
ru: Каждый четверг

source: Every Friday
ru: Каждую пятницу

source: Every Saturday
ru: Каждую субботу

source: Every Sunday
ru: Каждое воскресенье

source: hour
ru: час

source: Hour
ru: Час

source: Location of V2ray/Xray asset
ru: Расположение ресурсов V2ray/Xray

source: This variable specifies a directory where geoip.dat and geosite.dat files are.
ru: Эта переменная указывает каталог, в котором находятся файлы geoip.dat и geosite.dat.
